Revit 2024 API
AssetProperty.GetAllConnectedProperties Method
 Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IList<AssetProperty> GetAllConnectedProperties()
Visual Basic
Public Function GetAllConnectedProperties As IList(Of AssetProperty)
Visual C++
public:
IList<AssetProperty^>^ GetAllConnectedProperties()
Return Value
 A list of the connected properties.
See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace